app/views/ideas/index.html.erb

SELECT COUNT(*) FROM "likes" WHERE "likes"."idea_id" = $1  [["idea_id", 1]]
---

	<a href="<%= show_idea_path idea.id %>"><%= idea.likes.count %> people</a> like this.
