app/controllers/ideas_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "ideas".* FROM "ideas"
---
	def index
		@user = User.find(session[:user_id])
		@ideas = Idea.all

INSERT INTO "ideas" ("content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "First IDEA!"], ["user_id", 1], ["created_at", "2017-12-20 19:11:03.154212"], ["updated_at", "2017-12-20 19:11:03.154212"]]
---
	def create
		idea = Idea.create(idea_params)

SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = $1 LIMIT 1  [["id", 1]]
---
	def show
		@idea = Idea.find(params[:id])